{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[BOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[BOS]": {
        "id": "[BOS]",
        "ids": [
          1
        ],
        "tokens": [
          "[BOS]"
        ]
      },
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[EOS]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[BOS]": 1,
      "[EOS]": 2,
      "[UNK]": 3,
      " ": 4,
      "⠀": 5,
      "⠁": 6,
      "⠂": 7,
      "⠃": 8,
      "⠄": 9,
      "⠅": 10,
      "⠆": 11,
      "⠇": 12,
      "⠈": 13,
      "⠉": 14,
      "⠊": 15,
      "⠋": 16,
      "⠌": 17,
      "⠍": 18,
      "⠎": 19,
      "⠏": 20,
      "⠐": 21,
      "⠑": 22,
      "⠒": 23,
      "⠓": 24,
      "⠔": 25,
      "⠕": 26,
      "⠖": 27,
      "⠗": 28,
      "⠘": 29,
      "⠙": 30,
      "⠚": 31,
      "⠛": 32,
      "⠜": 33,
      "⠝": 34,
      "⠞": 35,
      "⠟": 36,
      "⠠": 37,
      "⠡": 38,
      "⠢": 39,
      "⠣": 40,
      "⠤": 41,
      "⠥": 42,
      "⠦": 43,
      "⠧": 44,
      "⠨": 45,
      "⠩": 46,
      "⠪": 47,
      "⠫": 48,
      "⠬": 49,
      "⠭": 50,
      "⠮": 51,
      "⠯": 52,
      "⠰": 53,
      "⠱": 54,
      "⠲": 55,
      "⠳": 56,
      "⠴": 57,
      "⠵": 58,
      "⠶": 59,
      "⠷": 60,
      "⠸": 61,
      "⠹": 62,
      "⠺": 63,
      "⠻": 64,
      "⠼": 65,
      "⠽": 66,
      "⠾": 67,
      "⠿": 68
    },
    "unk_token": "[UNK]"
  }
}